#!/usr/bin/env python
# -*- coding:utf-8 -*-
import time
from jd_assistant import Assistant

if __name__ == '__main__':
    """
    重要提示：此处为示例代码之一，请移步下面的链接查看使用教程👇
    https://github.com/tychxn/jd-assistant/wiki/1.-%E4%BA%AC%E4%B8%9C%E6%8A%A2%E8%B4%AD%E5%8A%A9%E6%89%8B%E7%94%A8%E6%B3%95
    """

    # 预约抢购
    sku_id = '100016553674'  # 商品id
    buy_time = '2020-12-01 14:59:59.950'  # 开始抢购时间，格式：'2020-11-28 12:59:59.950'，建议设置提前0.050秒，如果网络慢可根据自己网络情况适当修改
    retry = 5  # 抢购重复执行次数，可选参数，默认4次
    interval = 0.01  # 抢购执行间隔，可选参数，默认4秒
    num = 1  # 购买数量，可选参数，默认1个
    is_pass_cart = False  # 是否跳过添加购物车，需要根据预约类型判断，默认False
    sleep_interval = 0.5  # 抢购前倒计时轮询时间，默认0.5秒
    fast_sleep_interval = 0.01  # 抢购5秒内倒计时轮询时间，默认0.01秒
    asst = Assistant()  # 初始化
    asst.login_by_QRcode()  # 扫码登陆
    # 抢购前一定要确保购物车里没有其他商品，否则会一同下单
    asst.exec_reserve_seckill_by_time(sku_id=sku_id, buy_time=buy_time, retry=retry, interval=interval, num=num, is_pass_cart=is_pass_cart, sleep_interval=sleep_interval, fast_sleep_interval=fast_sleep_interval)


    # 定时抢购【注：不是预约抢购！！！这两个流程不一样】
    # area = ''  # 区域id
    # sku_buy_time = '2020-11-28 13:00:00.000'  # 商品抢购时间
    # buy_time = None  # 开始抢购时间，默认为None，自动提前0.050秒，网络通畅时不需要修改，如果网络慢可根据自己情况适当修改，格式：'2020-11-28 12:59:59.950'
    # fast_mode = True  # 快速模式：略过访问抢购订单结算页面这一步骤，默认为 True
    # asst.exec_seckill_by_time(sku_ids=sku_ids, buy_time=buy_time, sku_buy_time=sku_buy_time, retry=retry, interval=interval, num=num, fast_mode=fast_mode, sleep_interval=sleep_interval, fast_sleep_interval=fast_sleep_interval)


    # 根据商品是否有货自动下单
    # 6个参数：
    # sku_ids: 商品id。可以设置多个商品，也可以带数量，如：'1234' 或 '1234,5678' 或 '1234:2' 或 '1234:2,5678:3'
    # area: 地区id
    # wait_all: 是否等所有商品都有货才一起下单，可选参数，默认False
    # stock_interval: 查询库存时间间隔，可选参数，默认3秒
    # submit_retry: 提交订单失败后重试次数，可选参数，默认3次
    # submit_interval: 提交订单失败后重试时间间隔，可选参数，默认5秒
